case_full/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
    format ascii;
    class volScalarField;
    object p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField {
    inlet {
        type zeroGradient;
    }

    outlet {
        type fixedValue;
        value uniform 0;
    }

    y_max {
        type zeroGradient;
    }

    y_min {
        type zeroGradient;
    }

    z_max {
        type zeroGradient;
    }

    z_min {
        type zeroGradient;
    }

    cylinder {
        type zeroGradient;
    }
}

// ************************************************************************* //