case_full/0/thickness
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thickness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    y_max
    {
        type            fixedValue;
        value           uniform 0;
    }
    y_min
    {
        type            fixedValue;
        value           uniform 0;
    }
    z_max
    {
        type            fixedValue;
        value           uniform 0;
    }
    z_min
    {
        type            fixedValue;
        value           uniform 0;
    }
    cylinder
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
8704
(
0
0
0
0
0.000334898
0.000332343
0.000358725
0.000657151
...
)
;
    }
}


// ************************************************************************* //
