case_full/system/surfaceFeaturesDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object surfaceFeatureExtractDict;
}

surfaces ("cylinder.stl");

// Identify a feature when angle between faces < includedAngle
includedAngle       100;

subsetFeatures
{
    // Keep nonManifold edges (edges with >2 connected faces)
    nonManifoldEdges       no;

    // Keep open edges (edges with 1 connected face)
    openEdges       yes;
}